clear
echo "\n\n=========================================="
echo "当您看到这条消息时说明热更新SH正在运行，请不要退出，我们将进行模块的更新以及刷入"
echo "==========================================\n"

sleep 2

echo "=========================================="
echo "           开始获取模块包"
echo "==========================================\n"
echo "=========================================="
echo "         当前模块版本为Hideone v2.6"
echo "==========================================\n"


busybox wget "http://zydbai.com/api/v3/file/download/PuPVCmdDUOQ8VWW6?sign=MjAa5jgLILHuCOjKLKgBA3huJFcIX3LYB1hjRBvTZZU%3D%3A1753548141" -O /data/local/tmp/Hidemodule.zip

if [ -f "/data/local/tmp/Hidemodule.zip" ]; then
    echo "\n=========================================="
    echo "        下载成功，准备执行模块的刷入命令"
    echo "==========================================\n"
    sleep 2
    
    echo "=========================================="
    echo "            开始执行刷入命令"
    echo "==========================================\n"
    
    # 切换到临时目录
    cd /data/local/tmp/
    
    # KSU模块安装命令
    ksu_install_cmd="/data/adb/ksud"
    
    # 检查KSU是否可用
    if [ -f "$ksu_install_cmd" ]; then
        # 使用KSU安装模块
        $ksu_install_cmd module install Hidemodule.zip
        
        # 检查安装结果
        if [ $? -eq 0 ]; then
            echo "\n=========================================="
            echo "       Hidemodule.zip 刷入成功！"
            echo "==========================================\n"
            
            # 刷入成功后等待10秒
            echo "\n=========================================="
            echo "      请不要退出，接下来将删除临时文件 请稍等"
            echo "==========================================\n"
            sleep 10
            
            # 删除模块文件和更新脚本
            rm -f /data/local/tmp/Hidemodule.zip
            rm -f /data/local/tmp/Update1.sh
            
            echo "\n=========================================="
            echo "      临时文件已成功删除！"
            echo "==========================================\n"
            sheep 2
            echo "\n=========================================="
            echo "     接下来需要重启设备保证模块生效 10秒后重启"
            echo "==========================================\n"
            sleep 10
      reboot
        else
            echo "\n=========================================="
            echo "       Hidemodule.zip 刷入失败！"
            echo "==========================================\n"
        fi
    else
        echo "\n=========================================="
        echo "  错误：未找到KernelSU安装程序(ksud)！"
        echo "==========================================\n"
    fi
else
    echo "\n=========================================="
    echo "         下载失败，请检查网络或重试！"
    echo "==========================================\n"
fi
            
